tap "doprz/dipc"
tap "homebrew/bundle"
tap "thezoraiz/ascii-image-converter"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Simple terminal UI for git commands
brew "lazygit"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# GPU-based terminal emulator
cask "kitty"
# IDE for professional Python development
cask "pycharm"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
